export default {
  translation: {
    home: {
      title: 'सुडोकु',
      startGame: 'खेल शुरू करें',
      createGame: 'नया खेल बनाएं',
      settings: 'सेटिंग्स',
    },
    game: {
      pause: 'रोकें',
      resume: 'जारी रखें',
      restart: 'पुनः प्रारंभ करें',
      quit: 'बाहर निकलें',
    },
    difficulty: {
      title: 'कठिनाई स्तर चुनें',
      entry: '😀प्रवेश',
      easy: '🤔आसान',
      medium: '😮मध्यम',
      hard: '😣कठिन',
      extreme: '🤯अत्यंत कठिन',
      custom: 'कस्टम',
    },
    start: 'शुरू करें',
    continue: 'जारी रखें',
    undo: 'पूर्ववत करें',
    erase: 'मिटाएं',
    notes: 'नोट्स',
    autoNote: 'स्वचालित नोट्स',
    hint: 'संकेत',
    apply: 'लागू करें',
    cancel: 'रद्द करें',
    selectMode: 'मोड चुनें',
    legal: 'वैध सुडोकु',
    solving: 'हल कर रहे हैं...',
    illegal: 'अवैध सुडोकु',
    answer: 'उत्तर',
    incomplete: 'अपूर्ण सुडोकु',
    CHECK_CANDIDATE: 'उम्मीदवार जांच',
    SINGLE_CANDIDATE: 'एकल उम्मीदवार',
    HIDDEN_SINGLE_ROW: 'छिपा हुआ एकल',
    HIDDEN_SINGLE_COLUMN: 'छिपा हुआ एकल',
    HIDDEN_SINGLE_BOX: 'छिपा हुआ एकल',
    BLOCK_ELIMINATION_ROW: 'खंड निष्कासन',
    BLOCK_ELIMINATION_COLUMN: 'खंड निष्कासन',
    BLOCK_ELIMINATION_BOX_ROW: 'खंड निष्कासन',
    BLOCK_ELIMINATION_BOX_COLUMN: 'खंड निष्कासन',
    NAKED_PAIR_ROW: 'नग्न जोड़ी',
    NAKED_PAIR_COLUMN: 'नग्न जोड़ी',
    NAKED_PAIR_BOX: 'नग्न जोड़ी',
    NAKED_TRIPLE_ROW1: 'नग्न तिकड़ी',
    NAKED_TRIPLE_COLUMN1: 'नग्न तिकड़ी',
    NAKED_TRIPLE_BOX1: 'नग्न तिकड़ी',
    NAKED_TRIPLE_ROW2: 'नग्न तिकड़ी',
    NAKED_TRIPLE_COLUMN2: 'नग्न तिकड़ी',
    NAKED_TRIPLE_BOX2: 'नग्न तिकड़ी',
    HIDDEN_PAIR_ROW: 'छिपी जोड़ी',
    HIDDEN_PAIR_COLUMN: 'छिपी जोड़ी',
    HIDDEN_PAIR_BOX: 'छिपी जोड़ी',
    HIDDEN_TRIPLE_ROW: 'छिपी तिकड़ी',
    HIDDEN_TRIPLE_COLUMN: 'छिपी तिकड़ी',
    HIDDEN_TRIPLE_BOX: 'छिपी तिकड़ी',
    NAKED_QUADRUPLE_ROW: 'नग्न चौकड़ी',
    NAKED_QUADRUPLE_COLUMN: 'नग्न चौकड़ी',
    NAKED_QUADRUPLE_BOX: 'नग्न चौकड़ी',
    X_WING_ROW: 'एक्स विंग',
    X_WING_COLUMN: 'एक्स विंग',
    X_WING_VARIENT_ROW: 'एक्स विंग विविधता',
    X_WING_VARIENT_COLUMN: 'एक्स विंग विविधता',
    XY_WING: 'एक्स-वाई विंग',
    XYZ_WING: 'एक्स-वाई-जेड विंग',
    SKYSCRAPER: 'गगनचुंबी',
    SKYSCRAPER2: 'दो मजबूत कड़ियाँ',
    THREESTRONGLINKS: 'तीन मजबूत कड़ियाँ',
    XCHAIN: 'एक्स श्रृंखला',
    COMBINATION_CHAIN: 'संयोजन श्रृंखला',
    SWORDFISH_ROW: 'तलवारमछली',
    SWORDFISH_COLUMN: 'तलवारमछली',
    JELLYFISH_ROW: 'जेलीफिश',
    JELLYFISH_COLUMN: 'जेलीफिश',
    WXYZ_WING: 'डब्ल्यू-एक्स-वाई-जेड विंग',
    LOOP: 'लूप',
    UNIQUE_RECTANGLE: 'अद्वितीय आयत',
    BINARY_UNIVERSAL_GRAVE: 'बाइनरी अनिवार्य ग्रव',
    DOUBLE_COLOR_CHAIN: 'द्विरंगी श्रृंखला',
    TRIPLE_COLOR_CHAIN: 'दो डोरी वाली पतंग',
    TWO_STRING_KITE: 'दो स्ट्रिंग कीट',
    TRIAL_AND_ERROR: 'परीक्षण और त्रुटि',
    duration: 'समय',
    mistakes: 'गलतियां',
    hintCount: 'संकेत संख्या',
    hints: {
      SINGLE_CANDIDATE:
        'सेल R{{row}}C{{col}} में केवल एक उम्मीदवार {{target}} बचा है, इसलिए इस सेल का मान {{target}} होना चाहिए',
      HIDDEN_SINGLE_ROW:
        'पंक्ति {{row}} में अंक {{target}} केवल एक सेल में संभव है, इसलिए इस सेल का मान {{target}} होना चाहिए',
      HIDDEN_SINGLE_COLUMN:
        'कॉलम {{col}} में अंक {{target}} केवल एक सेल में संभव है, इसलिए इस सेल का मान {{target}} होना चाहिए',
      HIDDEN_SINGLE_BOX:
        'बॉक्स {{box}} में अंक {{target}} केवल एक सेल में संभव है, इसलिए इस सेल का मान {{target}} होना चाहिए',
      TRIAL_AND_ERROR:
        'न्यूनतम उम्मीदवारों वाले सेल में {{target}} भरने का प्रयास करें। यदि कोई समाधान नहीं मिलता है, तो {{target}} गलत है और अन्य उम्मीदवारों को आज़माएं',
      BLOCK_ELIMINATION_ROW:
        'बॉक्स {{box}} में, अंक {{target}} केवल स्थिति {{positions}} में दिखाई देता है, इसलिए उसी पंक्ति में अन्य स्थानों पर {{target}} नहीं हो सकता',
      BLOCK_ELIMINATION_COLUMN:
        'बॉक्स {{box}} में, अंक {{target}} केवल स्थिति {{positions}} में दिखाई देता है, इसलिए उसी कॉलम में अन्य स्थानों पर {{target}} नहीं हो सकता',
      BLOCK_ELIMINATION_BOX_ROW:
        'पंक्ति {{row}} में, अंक {{target}} केवल स्थिति {{positions}} में दिखाई देता है, इसलिए उसी बॉक्स में अन्य स्थानों पर {{target}} नहीं हो सकता',
      BLOCK_ELIMINATION_BOX_COLUMN:
        'कॉलम {{col}} में, अंक {{target}} केवल स्थिति {{positions}} में दिखाई देता है, इसलिए उसी बॉक्स में अन्य स्थानों पर {{target}} नहीं हो सकता',
      NAKED_PAIR_ROW:
        'पंक्ति {{row}} में, अंक {{target}} केवल दो सेल {{positions}} में हो सकता है, इसलिए इस पंक्ति के अन्य सेल में {{target}} नहीं हो सकता',
      NAKED_PAIR_COLUMN:
        'कॉलम {{col}} में, अंक {{target}} केवल दो सेल {{positions}} में हो सकता है, इसलिए इस कॉलम के अन्य सेल में {{target}} नहीं हो सकता',
      NAKED_PAIR_BOX:
        'बॉक्स {{box}} में, अंक {{target}} केवल दो सेल {{positions}} में हो सकता है, इसलिए इस बॉक्स के अन्य सेल में {{target}} नहीं हो सकता',
      NAKED_TRIPLE_ROW1:
        'पंक्ति {{row}} में, अंक {{target}} केवल तीन सेल {{positions}} में हो सकता है, इसलिए इस पंक्ति के अन्य सेल में {{target}} नहीं हो सकता',
      NAKED_TRIPLE_COLUMN1:
        'कॉलम {{col}} में, अंक {{target}} केवल तीन सेल {{positions}} में हो सकता है, इसलिए इस कॉलम के अन्य सेल में {{target}} नहीं हो सकता',
      NAKED_TRIPLE_BOX1:
        'बॉक्स {{box}} में, अंक {{target}} केवल तीन सेल {{positions}} में हो सकता है, इसलिए इस बॉक्स के अन्य सेल में {{target}} नहीं हो सकता',
      NAKED_TRIPLE_ROW2:
        'पंक्ति {{row}} में, अंक {{target}} केवल तीन सेल {{positions}} में हो सकता है, इसलिए इस पंक्ति के अन्य सेल में {{target}} नहीं हो सकता',
      NAKED_TRIPLE_COLUMN2:
        'कॉलम {{col}} में, अंक {{target}} केवल तीन सेल {{positions}} में हो सकता है, इसलिए इस कॉलम के अन्य सेल में {{target}} नहीं हो सकता',
      NAKED_TRIPLE_BOX2:
        'बॉक्स {{box}} में, अंक {{target}} केवल तीन सेल {{positions}} में हो सकता है, इसलिए इस बॉक्स के अन्य सेल में {{target}} नहीं हो सकता',
      HIDDEN_PAIR_ROW:
        'पंक्ति {{row}} में, अंक {{candStr}} केवल दो सेल {{positions}} में दिखाई देते हैं, इसलिए इन दो सेल में अन्य अंक नहीं हो सकते',
      HIDDEN_PAIR_COLUMN:
        'कॉलम {{col}} में, अंक {{candStr}} केवल दो सेल {{positions}} में दिखाई देते हैं, इसलिए इन दो सेल में अन्य अंक नहीं हो सकते',
      HIDDEN_PAIR_BOX:
        'बॉक्स {{box}} में, अंक {{candStr}} केवल दो सेल {{positions}} में दिखाई देते हैं, इसलिए इन दो सेल में अन्य अंक नहीं हो सकते',
      HIDDEN_TRIPLE_ROW:
        'पंक्ति {{row}} में, अंक {{candStr}} केवल तीन सेल {{positions}} में दिखाई देते हैं, इसलिए इन तीन सेल में अन्य अंक नहीं हो सकते',
      HIDDEN_TRIPLE_COLUMN:
        'कॉलम {{col}} में, अंक {{candStr}} केवल तीन सेल {{positions}} में दिखाई देते हैं, इसलिए इन तीन सेल में अन्य अंक नहीं हो सकते',
      HIDDEN_TRIPLE_BOX:
        'बॉक्स {{box}} में, अंक {{candStr}} केवल तीन सेल {{positions}} में दिखाई देते हैं, इसलिए इन तीन सेल में अन्य अंक नहीं हो सकते',
      NAKED_QUADRUPLE_ROW:
        'पंक्ति {{row}} में, अंक {{target}} केवल चार सेल {{positions}} में हो सकता है, इसलिए इस पंक्ति के अन्य सेल में {{target}} नहीं हो सकता',
      NAKED_QUADRUPLE_COLUMN:
        'कॉलम {{col}} में, अंक {{target}} केवल चार सेल {{positions}} में हो सकता है, इसलिए इस कॉलम के अन्य सेल में {{target}} नहीं हो सकता',
      NAKED_QUADRUPLE_BOX:
        'बॉक्स {{box}} में, अंक {{target}} केवल चार सेल {{positions}} में हो सकता है, इसलिए इस बॉक्स के अन्य सेल में {{target}} नहीं हो सकता',
      X_WING_ROW:
        'पंक्ति {{row1}} और {{row2}} में, अंक {{candStr}} प्रत्येक पंक्ति में दो स्थानों पर है और उनके कॉलम समान हैं। इन चार सेल में से कोई भी दो सत्य होने पर, इन दो कॉलम के अन्य स्थानों पर यह अंक नहीं हो सकता',
      X_WING_COLUMN:
        'कॉलम {{col1}} और {{col2}} में, अंक {{candStr}} प्रत्येक कॉलम में दो स्थानों पर है और उनकी पंक्तियां समान हैं। इन चार सेल में से कोई भी दो सत्य होने पर, इन दो पंक्तियों के अन्य स्थानों पर यह अंक नहीं हो सकता',
      X_WING_VARIENT_ROW:
        '{{positions}} इन {{length}} सेल में से किसी भी दो में {{candStr}} होने पर, R{{row}}C{{col}} में {{candStr}} नहीं हो सकता',
      X_WING_VARIENT_COLUMN:
        '{{positions}} इन {{length}} सेल में से किसी भी दो में {{candStr}} होने पर, R{{row}}C{{col}} में {{candStr}} नहीं हो सकता',
      XY_WING:
        '{{positions}} इन तीन सेल में कोई भी मान हो, {{deleteStr}} में अंक {{candStr}} नहीं हो सकता',
      XYZ_WING:
        '{{positions}} इन तीन सेल में कोई भी मान हो, {{deleteStr}} में अंक {{candStr}} नहीं हो सकता',
      SKYSCRAPER:
        '{{positions}} ये नीले सेल एक संयुक्त श्रृंखला बनाते हैं। चाहे R{{row1}}C{{col1}} या R{{row2}}C{{col2}} में {{target}} हो, {{deleteStr}} में अंक {{target}} नहीं हो सकता',
      SKYSCRAPER2:
        'सेल R{{row1}}C{{col1}} और R{{row2}}C{{col2}} एक मजबूत श्रृंखला बनाते हैं, और सेल R{{row3}}C{{col3}} और R{{row4}}C{{col4}} दूसरी मजबूत श्रृंखला बनाते हैं। ये दोनों श्रृंखलाएं R{{row3}}C{{col3}} और R{{row2}}C{{col2}} के बीच एक कमजोर श्रृंखला से जुड़ी हैं। यदि R{{row1}}C{{col1}} सत्य है, तो {{deleteStr}} असत्य होना चाहिए। यदि R{{row1}}C{{col1}} असत्य है, तो R{{row4}}C{{col4}} सत्य होना चाहिए, जो फिर भी {{deleteStr}} को असत्य बनाएगा। किसी भी स्थिति में, अंक {{target}} {{deleteStr}} में नहीं हो सकता',
      WXYZ_WING:
        '{{candStr}} WXYZ-विंग बनाते हैं, जिसमें R{{row1}}C{{col1}} केंद्र है। इन चार सेल में कोई भी मान हो, अंक {{target}} {{deleteStr}} में नहीं हो सकता',
      COMBINATION_CHAIN_3_2_1_STRONG:
        '{{candStr1}} का संयोजन और {{candStr2}} एक मजबूत श्रृंखला बनाते हैं। चाहे {{candStr4}} में से कोई भी सत्य हो, अंक {{target}} {{posStr}} में नहीं हो सकता',
      COMBINATION_CHAIN_3_2_1_WEAK:
        '{{candStr1}} का संयोजन और {{candStr2}} एक मजबूत श्रृंखला बनाते हैं, {{candStr3}} चार सेल एक मजबूत श्रृंखला बनाते हैं। ये दो मजबूत श्रृंखलाएं {{pivotStr}} द्वारा बनाई गई कमजोर श्रृंखला से जुड़ी हैं। चाहे {{candStr4}} में से कोई भी सत्य हो, अंक {{target}} {{posStr}} में नहीं हो सकता',
      COMBINATION_CHAIN_3_2_2_WEAK:
        '{{candStr1}} का संयोजन और {{candStr2}} एक मजबूत श्रृंखला बनाते हैं, {{candStr3}} दो सेल एक मजबूत श्रृंखला बनाते हैं। ये दो मजबूत श्रृंखलाएं {{pivotStr1}} और {{pivotStr2}} दो सेल की समग्रता द्वारा बनाई गई कमजोर श्रृंखला से जुड़ी हैं। चाहे {{candStr4}} में से कोई भी सत्य हो, अंक {{target}} {{posStr}} में नहीं हो सकता',
      COMBINATION_CHAIN_3_2_2_STRONG:
        '{{candStr1}} का संयोजन और {{candStr2}} एक मजबूत श्रृंखला बनाते हैं, {{candStr3}} दो सेल एक मजबूत श्रृंखला बनाते हैं। ये दो मजबूत श्रृंखलाएं {{pivotStr1}} और {{pivotStr2}} दो सेल की समग्रता द्वारा बनाई गई मजबूत श्रृंखला से जुड़ी हैं। चाहे {{candStr4}} में से कोई भी सत्य हो, अंक {{target}} {{posStr}} में नहीं हो सकता',
      LOOP_3_2_2:
        '{{nodeStr1}} एक मजबूत श्रृंखला बनाते हैं, {{nodeStr2}} एक मजबूत श्रृंखला बनाते हैं, {{nodeStr3}} एक मजबूत श्रृंखला बनाते हैं, वे एक कमजोर श्रृंखला के माध्यम से एक लूप बनाते हैं, मान लें कि {{rootNodeStr}} असत्य है और इसे प्रारंभ बिंदु के रूप में लेते हुए क्रमशः घड़ी की दिशा में और विपरीत दिशा में तर्क का अनुसरण करते हैं, अंततः लूप पर किसी न किसी नोड में विरोधाभास उत्पन्न होगा, इसलिए {{rootNodeStr}} सत्य होना चाहिए',
      LOOP_3_2:
        '{{nodeStr1}} एक मजबूत श्रृंखला बनाते हैं, {{nodeStr2}} एक मजबूत श्रृंखला बनाते हैं, वे एक कमजोर श्रृंखला के माध्यम से एक लूप बनाते हैं, मान लें कि {{rootNodeStr}} असत्य है और इसे प्रारंभ बिंदु के रूप में लेते हुए क्रमशः घड़ी की दिशा में और विपरीत दिशा में तर्क का अनुसरण करते हैं, अंततः लूप पर किसी न किसी नोड में विरोधाभास उत्पन्न होगा, इसलिए {{rootNodeStr}} सत्य होना चाहिए',
      UNIQUE_RECTANGLE1:
        '{{nodeStr}} और {{deleteStr}} एक अद्वितीय आयत संरचना बनाते हैं, यानी बोर्ड में चार सेल होते हैं, वे एक आयत बनाते हैं और प्रत्येक में दो समान उम्मीदवार होते हैं। जब बोर्ड में यह संरचना दिखाई देती है, तो इसका मतलब है कि वर्तमान सुडोकू अवैध है, इसलिए {{deleteStr}} को उम्मीदवार {{target}} को समाप्त करना चाहिए ताकि सुडोकू का एकमात्र समाधान हो सके',
      UNIQUE_RECTANGLE2:
        'यदि लाल सेल में {{target}} है, तो {{nodeStr}} के चार सेल एक अद्वितीय आयत संरचना बनाएंगे, यानी बोर्ड में चार सेल होते हैं, वे एक आयत बनाते हैं और प्रत्येक में दो समान उम्मीदवार होते हैं। जब बोर्ड में यह संरचना दिखाई देती है, तो इसका मतलब है कि वर्तमान सुडोकू अवैध है। इसलिए, लाल सेल में उम्मीदवार {{target}} नहीं हो सकता',
      BINARY_UNIVERSAL_GRAVE:
        'मान लें कि {{posStr}} में {{target}} नहीं है, बोर्ड पर सभी उम्मीदवार सेल में केवल दो उम्मीदवार होते हैं, और प्रत्येक उम्मीदवार प्रत्येक पंक्ति, कॉलम और बॉक्स में केवल दो बार दिखाई देता है। यह संरचना सुडोकू में कई समाधान उत्पन्न करेगी। इस स्थिति से बचने के लिए, {{posStr}} में {{target}} होना चाहिए',
      SWORDFISH_ROW:
        'नीले वर्ग वाली तीन पंक्तियों में {{target}} के लिए अन्य संभावित वर्ग मौजूद नहीं हैं, इन वर्गों में कैसे भी चुना जाए, उनके संबंधित तीन कॉलम में संभावित संख्या {{target}} मौजूद नहीं होनी चाहिए',
      SWORDFISH_COLUMN:
        'नीले वर्ग वाले तीन कॉलम में {{target}} के लिए अन्य संभावित वर्ग मौजूद नहीं हैं, इन वर्गों में कैसे भी चुना जाए, उनके संबंधित तीन पंक्तियों में संभावित संख्या {{target}} मौजूद नहीं होनी चाहिए',
      JELLYFISH_ROW:
        'नीले वर्ग वाली चार पंक्तियों में {{target}} के लिए अन्य संभावित वर्ग मौजूद नहीं हैं, इन वर्गों में कैसे भी चुना जाए, उनके संबंधित चार कॉलम में संभावित संख्या {{target}} मौजूद नहीं होनी चाहिए',
      JELLYFISH_COLUMN:
        'नीले वर्ग वाले चार कॉलम में {{target}} के लिए अन्य संभावित वर्ग मौजूद नहीं हैं, इन वर्गों में कैसे भी चुना जाए, उनके संबंधित चार पंक्तियों में संभावित संख्या {{target}} मौजूद नहीं होनी चाहिए',
      DOUBLE_COLOR_CHAIN_delete:
        'जब {{posStr}} {{target}} लेता है, तो लाल सेल {{target}} नहीं ले सकता',
      DOUBLE_COLOR_CHAIN_s:
        'जब {{posStr1}} {{target1}} लेता है, तो इससे {{posStr2}} {{target2}} लेगा',
      DOUBLE_COLOR_CHAIN_r:
        'जब {{posStr1}} {{target}} लेता है, तो इससे {{posStr2}} {{target}} नहीं ले सकेगा',
      DOUBLE_COLOR_CHAIN_q:
        'क्योंकि {{posStr1}} और {{posStr2}} {{target}} के लिए एक मजबूत लिंक बनाते हैं, इसलिए {{posStr2}} {{target}} होना चाहिए',
      DOUBLE_COLOR_CHAIN_q_start:
        'जब {{posStr}} {{target1}} लेता है, तो वर्तमान सेल {{target2}} नहीं ले सकता',
      COMBINATION_CHAIN_AB_STRONG: '{{A}} और {{B}} एक मजबूत कड़ी बनाते हैं',
      COMBINATION_CHAIN_AB_WEAK: '{{A}} और {{B}} एक कमजोर कड़ी बनाते हैं',
      COMBINATION_CHAIN_END:
        'जब {{A}} सत्य है, तो लाल कक्ष असत्य है। जब {{A}} असत्य है, तो अनुमान द्वारा {{B}} सत्य हो जाता है, और लाल कक्ष फिर भी असत्य रहता है',
      SKYSCRAPER2_1:
        'दो कक्षों {{As}} के बीच एक मजबूत कड़ी है, चार कक्षों {{Bs}} के बीच एक मजबूत कड़ी है, और ये दो मजबूत कड़ियां दो कक्षों {{Cs}} के बीच एक कमजोर कड़ी से जुड़ी हैं। जब {{A}} सत्य है, तो लाल कक्ष असत्य है। जब {{A}} असत्य है, तो {{B}} सत्य है, और लाल कक्ष फिर भी असत्य है',
      SKYSCRAPER2_2:
        'दो कक्षों {{As}} के बीच एक मजबूत कड़ी है, दो कक्षों {{Bs}} के बीच एक मजबूत कड़ी है, और दो कक्षों {{Cs}} के बीच एक मजबूत कड़ी है। प्रत्येक मजबूत कड़ी कमजोर कड़ियों द्वारा अन्य से जुड़ी हुई है। जब {{A}} सत्य है, तो लाल कक्ष असत्य है। जब {{A}} असत्य है, तो {{B}} सत्य है, और लाल कक्ष फिर भी असत्य है',
    },
    back: 'वापस',
    next: 'अगला',
    errorDraft: 'नोट्स में त्रुटि है, कृपया पहले सुधारें',
    pleaseConnectNetwork: 'कृपया नेटवर्क से कनेक्ट करें',
    setting: 'सेटिंग्स',
    removeAD: 'विज्ञापन हटाएं',
    sound: 'ध्वनि',
    notice: 'सूचना',
    privacyPolicy: 'गोपनीयता नीति',
    serviceTerms: 'सेवा शर्तें',
    language: 'भाषा',
    feedback: 'प्रतिक्रिया',
    feedbackMessage: 'संदेश:',
    congratulations: 'बधाई हो!',
    restore: 'खरीदारी पुनर्स्थापित करें',
    restoring: 'खरीदारी पुनर्स्थापित कर रहा है...',
    purchasing: 'खरीदारी कर रहा है...',
    illegalPrompt:
      'सिस्टम ने आपके प्रोग्राम बाहर आने की व्यवस्था देखी है, जो एड ब्लॉकिंग के संदर्भ में है। कृपया एक मिनट इंतजार करें और फिर प्रयास करें।',
    highlight: 'हाइलाइट',
    myBoards: 'मेरे सुडोकू',
    Home: 'होम',
    saveToMyBoards: 'मेरे सुडोकू में सहेजें',
    pleaseNameYourSudoku: 'कृपया आपके सुडोकू का नाम दें',
    success: 'सफलता',
    sudokuSavedToMyBoards: 'सुडोकू मेरे सुडोकू में सहेजा गया है!',
    error: 'त्रुटि',
    saveFailedPleaseTryAgainLater: 'सुडोकू सहेजने में विफल, कृपया फिर से प्रयास करें',
    confirm: 'सुनिश्चित करें',
    noNetwork:
      'आपके पास नेटवर्क कनेक्शन नहीं है। यदि आप जारी रखते हैं, तो आपका सुडोकू सहेजा नहीं जाएगा। क्या आप जारी रखना चाहते हैं?',
    loading: 'लोडिंग...',
    pleaseCheckNetwork: 'लोडिंग फेल हो गई है, कृपया जाँचें कि नेटवर्क कनेक्शन स्थापित है या नहीं',
    pleaseCheckiCloud: 'लोडिंग फेल हो गई है, कृपया जाँचें कि iCloud लॉग इन है या नहीं',
    untitled: 'अशीर्षित',
    enlarge: 'बड़ा करें',
    encourage: 'हमें प्रोत्साहित करें❤️',
    share: 'शेयर करें',
    shareMessage: 'एक सुडोकू गेम जो स्वचालित करता है, आजमाएं!',
    wether: 'चाहे कौन सी स्थिति हो, लाल सेल में {{target}} नहीं हो सकता',
    case1: 'स्थिति 1:',
    case2: 'स्थिति 2:',
    case3: 'स्थिति 3:',
    comma: ',',
    period: '.',
    end1: 'लाल सेल में {{target}} नहीं हो सकता',
    end2: 'लाल सेल में अभी भी {{target}} नहीं हो सकता',
    theme: 'थीम',
    selectTheme: 'थीम चुनें',
    lightMode: 'हलकी थीम',
    darkMode: 'गहरी थीम',
    strictMode: 'स्ट्रिक्ट मोड',
    reasonMode: 'रीजनिंग मोड',
    strictText:
      'स्ट्रिक्ट मोड: जब आप इनपुट करते हैं, तो यह सही नहीं है, तो एरर संदेश दिखाई देता है',
    reasonText:
      'रीजनिंग मोड: जब आप इनपुट करते हैं, तो यह सही नहीं है, तो एरर संदेश नहीं दिखाई देता है',
    localGames: 'लोकल सुडोकू',
    statistics: 'स्टैटिस्टिक्स',
    entry: 'शुरू',
    easy: 'आसान',
    medium: 'मध्यम',
    hard: 'कठिन',
    extreme: 'अति कठिन',
    dataSync: 'डेटा सिंक्रनाइज़ेशन इंस्ट्रक्शन',
    dataSyncDescription:
      '1.दोस्ताना अनुस्मारक: यदि आप अपना डिवाइस बदलते हैं, तो iCloud डेटा तुरंत नए डिवाइस पर सिंक नहीं हो सकता है। हम सुझाव देते हैं कि आप ऐप को कई बार फिर से खोलें या कुछ समय प्रतीक्षा करें। इस अवधि के दौरान, आप स्थानीय पहेलियों पर काम कर सकते हैं। पुराने डेटा के अपडेट होने के बाद, ऐप स्वचालित रूप से आपको नए डेटा को एकीकृत करने में मदद करेगा।',
    total: 'कुल',
    pleaseLoginGameCenter:
      'कृपया पहले GameCenter में लॉगिन करें। यदि आप पहले से लॉगिन हैं, तो ऐप को फिर से खोलें।',
    tips: 'सुझाव',
    dataSyncDescription2: '2.आपकी रैंकिंग 24 घंटों के भीतर विश्व स्तर पर सिंक्रनाइज़ की जाएगी।',
  },
};
