export default {
  translation: {
    home: {
      title: 'ซูโดกุ',
      startGame: 'เริ่มเกม',
      createGame: 'สร้างเกม',
      settings: 'ตั้งค่า',
    },
    game: {
      pause: 'หยุดชั่วคราว',
      resume: 'เล่นต่อ',
      restart: 'เริ่มใหม่',
      quit: 'ออก',
    },
    difficulty: {
      title: 'เลือกระดับความยาก',
      entry: '😀เริ่มต้น',
      easy: '🤔ง่าย',
      medium: '😮ปานกลาง',
      hard: '😣ยาก',
      extreme: '🤯ยากมาก',
      custom: 'กำหนดเอง',
    },
    start: 'เริ่ม',
    continue: 'ดำเนินต่อ',
    undo: 'ย้อนกลับ',
    erase: 'ลบ',
    notes: 'บันทึก',
    autoNote: 'บันทึกอัตโนมัติ',
    hint: 'คำใบ้',
    apply: 'ใช้งาน',
    cancel: 'ยกเลิก',
    selectMode: 'เลือกโหมด',
    legal: 'ถูกต้อง',
    solving: 'กำลังแก้...',
    illegal: 'ไม่ถูกต้อง',
    answer: 'คำตอบ',
    incomplete: 'ไม่สมบูรณ์',
    CHECK_CANDIDATE: 'ตรวจสอบตัวเลือก',
    SINGLE_CANDIDATE: 'ตัวเลือกเดียว',
    HIDDEN_SINGLE_ROW: 'ตัวเลขซ่อนเดี่ยว',
    HIDDEN_SINGLE_COLUMN: 'ตัวเลขซ่อนเดี่ยว',
    HIDDEN_SINGLE_BOX: 'ตัวเลขซ่อนเดี่ยว',
    BLOCK_ELIMINATION_ROW: 'การกำจัดบล็อก',
    BLOCK_ELIMINATION_COLUMN: 'การกำจัดบล็อก',
    BLOCK_ELIMINATION_BOX_ROW: 'การกำจัดบล็อก',
    BLOCK_ELIMINATION_BOX_COLUMN: 'การกำจัดบล็อก',
    NAKED_PAIR_ROW: 'คู่เปิดเผย',
    NAKED_PAIR_COLUMN: 'คู่เปิดเผย',
    NAKED_PAIR_BOX: 'คู่เปิดเผย',
    NAKED_TRIPLE_ROW1: 'สามตัวเปิดเผย',
    NAKED_TRIPLE_COLUMN1: 'สามตัวเปิดเผย',
    NAKED_TRIPLE_BOX1: 'สามตัวเปิดเผย',
    NAKED_TRIPLE_ROW2: 'สามตัวเปิดเผย',
    NAKED_TRIPLE_COLUMN2: 'สามตัวเปิดเผย',
    NAKED_TRIPLE_BOX2: 'สามตัวเปิดเผย',
    HIDDEN_PAIR_ROW: 'คู่ซ่อน',
    HIDDEN_PAIR_COLUMN: 'คู่ซ่อน',
    HIDDEN_PAIR_BOX: 'คู่ซ่อน',
    HIDDEN_TRIPLE_ROW: 'สามตัวซ่อน',
    HIDDEN_TRIPLE_COLUMN: 'สามตัวซ่อน',
    HIDDEN_TRIPLE_BOX: 'สามตัวซ่อน',
    NAKED_QUADRUPLE_ROW: 'สี่ตัวเปิดเผย',
    NAKED_QUADRUPLE_COLUMN: 'สี่ตัวเปิดเผย',
    NAKED_QUADRUPLE_BOX: 'สี่ตัวเปิดเผย',
    X_WING_ROW: 'X-Wing',
    X_WING_COLUMN: 'X-Wing',
    X_WING_VARIENT_ROW: 'X-Wing พร้อมครีบ',
    X_WING_VARIENT_COLUMN: 'X-Wing พร้อมครีบ',
    XY_WING: 'xy-wing',
    XYZ_WING: 'xyz-wing',
    SKYSCRAPER: 'ตึกระฟ้า',
    SKYSCRAPER2: 'ตึกระฟ้า2',
    REMOTE_PAIR: 'คู่ระยะไกล',
    COMBINATION_CHAIN: 'ห่วงโซ่ผสม',
    SWORDFISH_ROW: 'ปลาดาบ',
    SWORDFISH_COLUMN: 'ปลาดาบ',
    JELLYFISH_ROW: 'แมงกะพรุน',
    JELLYFISH_COLUMN: 'แมงกะพรุน',
    WXYZ_WING: 'wxyz-wing',
    LOOP: 'วงจร',
    UNIQUE_RECTANGLE: 'สี่เหลี่ยมผืนผ้าที่เป็นเอกลักษณ์',
    BINARY_UNIVERSAL_GRAVE: 'สี่เหลี่ยมผืนผ้าที่เป็นเอกลักษณ์',
    DOUBLE_COLOR_CHAIN: 'ห่วงโซ่สองสี',
    TRIPLE_COLOR_CHAIN: 'ห่วงโซ่สีสาม',
    TRIAL_AND_ERROR: 'ลองผิดลองถูก',
    duration: 'เวลา',
    mistakes: 'ข้อผิดพลาด',
    hintCount: 'จำนวนคำใบ้',
    hints: {
      SINGLE_CANDIDATE:
        'ช่อง R{{row}}C{{col}} มีตัวเลือกเดียวคือ {{target}} ดังนั้นค่าของช่องนี้คือ {{target}}',
      HIDDEN_SINGLE_ROW:
        'ตัวเลข {{target}} ในแถวที่ {{row}} มีตำแหน่งที่เป็นไปได้เพียงตำแหน่งเดียว ดังนั้นค่าของช่องนี้คือ {{target}}',
      HIDDEN_SINGLE_COLUMN:
        'ตัวเลข {{target}} ในคอลัมน์ที่ {{col}} มีตำแหน่งที่เป็นไปได้เพียงตำแหน่งเดียว ดังนั้นค่าของช่องนี้คือ {{target}}',
      HIDDEN_SINGLE_BOX:
        'ตัวเลข {{target}} ในกล่องที่ {{box}} มีตำแหน่งที่เป็นไปได้เพียงตำแหน่งเดียว ดังนั้นค่าของช่องนี้คือ {{target}}',
      TRIAL_AND_ERROR:
        'ลองใส่ {{target}} ในช่องที่มีตัวเลือกน้อยที่สุด หากไม่สามารถแก้ต่อได้ แสดงว่าการใส่ {{target}} เป็นการเลือกที่ผิด ให้ลองตัวเลือกอื่น',
      BLOCK_ELIMINATION_ROW:
        'ในกล่องที่ {{box}} ตัวเลข {{target}} ปรากฏเฉพาะในตำแหน่ง {{positions}} ดังนั้นในแถวเดียวกันนี้ ตำแหน่งอื่นๆ ไม่สามารถมีตัวเลข {{target}} ได้',
      BLOCK_ELIMINATION_COLUMN:
        'ในกล่องที่ {{box}} ตัวเลข {{target}} ปรากฏเฉพาะในตำแหน่ง {{positions}} ดังนั้นในคอลัมน์เดียวกันนี้ ตำแหน่งอื่นๆ ไม่สามารถมีตัวเลข {{target}} ได้',
      BLOCK_ELIMINATION_BOX_ROW:
        'ในแถวที่ {{row}} ตัวเลข {{target}} ปรากฏเฉพาะในตำแหน่ง {{positions}} ดังนั้นในกล่องเดียวกันนี้ ตำแหน่งอื่นๆ ไม่สามารถมีตัวเลข {{target}} ได้',
      BLOCK_ELIMINATION_BOX_COLUMN:
        'ในคอลัมน์ที่ {{col}} ตัวเลข {{target}} ปรากฏเฉพาะในตำแหน่ง {{positions}} ดังนั้นในกล่องเดียวกันนี้ ตำแหน่งอื่นๆ ไม่สามารถมีตัวเลข {{target}} ได้',
      NAKED_PAIR_ROW:
        'ในแถวที่ {{row}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสองช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในแถวนี้ไม่ควรมีตัวเลข {{target}}',
      NAKED_PAIR_COLUMN:
        'ในคอลัมน์ที่ {{col}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสองช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในคอลัมน์นี้ไม่ควรมีตัวเลข {{target}}',
      NAKED_PAIR_BOX:
        'ในกล่องที่ {{box}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสองช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในกล่องนี้ไม่ควรมีตัวเลข {{target}}',
      NAKED_TRIPLE_ROW1:
        'ในแถวที่ {{row}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสามช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในแถวนี้ไม่ควรมีตัวเลข {{target}}',
      NAKED_TRIPLE_COLUMN1:
        'ในคอลัมน์ที่ {{col}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสามช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในคอลัมน์นี้ไม่ควรมีตัวเลข {{target}}',
      NAKED_TRIPLE_BOX1:
        'ในกล่องที่ {{box}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสามช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในกล่องนี้ไม่ควรมีตัวเลข {{target}}',
      NAKED_TRIPLE_ROW2:
        'ในแถวที่ {{row}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสามช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในแถวนี้ไม่ควรมีตัวเลข {{target}}',
      NAKED_TRIPLE_COLUMN2:
        'ในคอลัมน์ที่ {{col}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสามช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในคอลัมน์นี้ไม่ควรมีตัวเลข {{target}}',
      NAKED_TRIPLE_BOX2:
        'ในกล่องที่ {{box}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสามช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในกล่องนี้ไม่ควรมีตัวเลข {{target}}',
      NAKED_QUADRUPLE_ROW:
        'ในแถวที่ {{row}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสี่ช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในแถวนี้ไม่ควรมีตัวเลข {{target}}',
      NAKED_QUADRUPLE_COLUMN:
        'ในคอลัมน์ที่ {{col}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสี่ช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในคอลัมน์นี้ไม่ควรมีตัวเลข {{target}}',
      NAKED_QUADRUPLE_BOX:
        'ในกล่องที่ {{box}} เนื่องจากตัวเลข {{target}} สามารถปรากฏได้เฉพาะในสี่ช่อง {{positions}} ดังนั้นตำแหน่งอื่นๆ ในกล่องนี้ไม่ควรมีตัวเลข {{target}}',
      HIDDEN_PAIR_ROW:
        'ในแถวที่ {{row}} เนื่องจากตัวเลข {{candStr}} ปรากฏเฉพาะในสองช่อง {{positions}} ดังนั้นสองช่องนี้ไม่ควรมีตัวเลือกอื่น',
      HIDDEN_PAIR_COLUMN:
        'ในคอลัมน์ที่ {{col}} เนื่องจากตัวเลข {{candStr}} ปรากฏเฉพาะในสองช่อง {{positions}} ดังนั้นสองช่องนี้ไม่ควรมีตัวเลือกอื่น',
      HIDDEN_PAIR_BOX:
        'ในกล่องที่ {{box}} เนื่องจากตัวเลข {{candStr}} ปรากฏเฉพาะในสองช่อง {{positions}} ดังนั้นสองช่องนี้ไม่ควรมีตัวเลือกอื่น',
      HIDDEN_TRIPLE_ROW:
        'ในแถวที่ {{row}} เนื่องจากตัวเลข {{candStr}} ปรากฏเฉพาะในสามช่อง {{positions}} ดังนั้นสามช่องนี้ไม่ควรมีตัวเลือกอื่น',
      HIDDEN_TRIPLE_COLUMN:
        'ในคอลัมน์ที่ {{col}} เนื่องจากตัวเลข {{candStr}} ปรากฏเฉพาะในสามช่อง {{positions}} ดังนั้นสามช่องนี้ไม่ควรมีตัวเลือกอื่น',
      HIDDEN_TRIPLE_BOX:
        'ในกล่องที่ {{box}} เนื่องจากตัวเลข {{candStr}} ปรากฏเฉพาะในสามช่อง {{positions}} ดังนั้นสามช่องนี้ไม่ควรมีตัวเลือกอื่น',
      X_WING_ROW:
        'ในแถวที่ {{row1}} และ {{row2}} ตัวเลข {{candStr}} ในแต่ละแถวมีสองตำแหน่งที่เป็นไปได้และอยู่ในคอลัมน์เดียวกัน ไม่ว่าสองตำแหน่งใดในสี่ตำแหน่งนี้จะเป็นจริง จะส่งผลให้ตำแหน่งอื่นในสองคอลัมน์นี้ต้องเป็นเท็จ',
      X_WING_COLUMN:
        'ในคอลัมน์ที่ {{col1}} และ {{col2}} ตัวเลข {{candStr}} ในแต่ละคอลัมน์มีสองตำแหน่งที่เป็นไปได้และอยู่ในแถวเดียวกัน ไม่ว่าสองตำแหน่งใดในสี่ตำแหน่งนี้จะเป็นจริง จะส่งผลให้ตำแหน่งอื่นในสองแถวนี้ต้องเป็นเท็จ',
      X_WING_VARIENT_ROW:
        'ไม่ว่าสองตำแหน่งใดใน {{positions}} ทั้ง {{length}} ตำแหน่งจะมีค่า {{candStr}} ก็จะส่งผลให้ช่อง R{{row}}C{{col}} ไม่ควรมีตัวเลข {{candStr}}',
      X_WING_VARIENT_COLUMN:
        'ไม่ว่าสองตำแหน่งใดใน {{positions}} ทั้ง {{length}} ตำแหน่งจะมีค่า {{candStr}} ก็จะส่งผลให้ช่อง R{{row}}C{{col}} ไม่ควรมีตัวเลข {{candStr}}',
      XY_WING:
        'ไม่ว่าสามช่อง {{positions}} จะมีค่าอย่างไร ตำแหน่ง {{deleteStr}} จะไม่สามารถมีตัวเลข {{candStr}} ได้',
      XYZ_WING:
        'ไม่ว่าสามช่อง {{positions}} จะมีค่าอย่างไร ตำแหน่ง {{deleteStr}} จะไม่สามารถมีตัวเลข {{candStr}} ได้',
      SKYSCRAPER:
        'ช่องสีน้ำเงิน {{positions}} สร้างลูกโซ่คู่ ไม่ว่า R{{row1}}C{{col1}} หรือ R{{row2}}C{{col2}} จะมีค่า {{target}} ตำแหน่ง {{deleteStr}} จะไม่สามารถมีตัวเลข {{target}} ได้',
      SKYSCRAPER2:
        'ช่อง R{{row1}}C{{col1}} และ R{{row2}}C{{col2}} สร้างลูกโซ่แข็งแรงหนึ่ง ช่อง R{{row3}}C{{col3}} และ R{{row4}}C{{col4}} สร้างลูกโซ่แข็งแรงอีกหนึ่ง ลูกโซ่ทั้งสองเชื่อมกันด้วยลูกโซ่อ่อนระหว่าง R{{row3}}C{{col3}} และ R{{row2}}C{{col2}} ถ้า R{{row1}}C{{col1}} เป็นจริง {{deleteStr}} ต้องเป็นเท็จ ถ้า R{{row1}}C{{col1}} เป็นเท็จ R{{row4}}C{{col4}} ต้องเป็นจริง ซึ่งก็จะทำให้ {{deleteStr}} เป็นเท็จเช่นกัน ไม่ว่าอย่างไร ตัวเลข {{target}} ก็ไม่สามารถปรากฏใน {{deleteStr}} ได้',
      REMOTE_PAIR:
        '{{posStr1}} สร้างคู่ระยะไกล คู่ระยะไกลทั้งสองนี้เชื่อมกันผ่าน {{posStr2}} สร้างลูกโซ่แข็งแรง ไม่ว่า {{posStr1}} ตัวใดจะเป็นจริง {{posStr}} จะไม่สามารถมีตัวเลข {{target}} ได้',
      WXYZ_WING:
        '{{candStr}} สร้าง WXYZ-Wing โดยมี R{{row1}}C{{col1}} เป็นจุดหมุน ไม่ว่าสี่ช่องนี้จะมีค่าอย่างไร ตัวเลข {{target}} จะไม่สามารถปรากฏใน {{deleteStr}} ได้',
      COMBINATION_CHAIN_3_2_1_STRONG:
        'การรวมกันของ {{candStr1}} กับ {{candStr2}} สร้างลูกโซ่แข็งแรง ไม่ว่าตัวใดใน {{candStr4}} จะเป็นจริง ตัวเลข {{target}} จะไม่สามารถปรากฏใน {{posStr}} ได้',
      COMBINATION_CHAIN_3_2_1_WEAK:
        'การรวมกันของ {{candStr1}} กับ {{candStr2}} สร้างลูกโซ่แข็งแรง {{candStr3}} สี่ช่องสร้างลูกโซ่แข็งแรง ลูกโซ่แข็งแรงทั้งสองเชื่อมกันผ่านลูกโซ่อ่อนที่สร้างจาก {{pivotStr}} ไม่ว่าตัวใดใน {{candStr4}} จะเป็นจริง ตัวเลข {{target}} จะไม่สามารถปรากฏใน {{posStr}} ได้',
      COMBINATION_CHAIN_3_2_2_WEAK:
        'การรวมกันของ {{candStr1}} กับ {{candStr2}} สร้างลูกโซ่แข็งแรง {{candStr3}} สองช่องสร้างลูกโซ่แข็งแรง ลูกโซ่แข็งแรงทั้งสองเชื่อมกันผ่านลูกโซ่อ่อนที่สร้างจากภาพรวมของ {{pivotStr1}} และ {{pivotStr2}} ไม่ว่าตัวใดใน {{candStr4}} จะเป็นจริง ตัวเลข {{target}} จะไม่สามารถปรากฏใน {{posStr}} ได้',
      COMBINATION_CHAIN_3_2_2_STRONG:
        'การรวมกันของ {{candStr1}} กับ {{candStr2}} สร้างลูกโซ่แข็งแรง {{candStr3}} สองช่องสร้างลูกโซ่แข็งแรง ลูกโซ่แข็งแรงทั้งสองเชื่อมกันผ่านลูกโซ่แข็งแรงที่สร้างจากภาพรวมของ {{pivotStr1}} และ {{pivotStr2}} ไม่ว่าตัวใดใน {{candStr4}} จะเป็นจริง ตัวเลข {{target}} จะไม่สามารถปรากฏใน {{posStr}} ได้',
      LOOP_3_2_2:
        '{{nodeStr1}} สร้างลูกโซ่แข็งแรงหนึ่ง {{nodeStr2}} สร้างลูกโซ่แข็งแรงอีกหนึ่ง {{nodeStr3}} สร้างลูกโซ่แข็งแรงอีกหนึ่ง ทั้งสามลูกโซ่เชื่อมกันด้วยลูกโซ่อ่อนสร้างเป็นวงกลม หากสมมติว่า {{rootNodeStr}} เป็นเท็จและใช้มันเป็นจุดเริ่มต้นในการวิเคราะห์ตามเข็มนาฬิกาและทวนเข็มนาฬิกา จะนำไปสู่ความขัดแย้งในบางจุดของวงกลม ดังนั้น {{rootNodeStr}} ต้องเป็นจริง',
      LOOP_3_2:
        '{{nodeStr1}} สร้างลูกโซ่แข็งแรงหนึ่ง {{nodeStr2}} สร้างลูกโซ่แข็งแรงอีกหนึ่ง ทั้งสองลูกโซ่เชื่อมกันด้วยลูกโซ่อ่อนสร้างเป็นวงกลม หากสมมติว่า {{rootNodeStr}} เป็นเท็จและใช้มันเป็นจุดเริ่มต้นในการวิเคราะห์ตามเข็มนาฬิกาและทวนเข็มนาฬิกา จะนำไปสู่ความขัดแย้งในบางจุดของวงกลม ดังนั้น {{rootNodeStr}} ต้องเป็นจริง',
      UNIQUE_RECTANGLE1:
        '{{nodeStr}} และ {{deleteStr}} สร้างโครงสร้างสี่เหลี่ยมผืนผ้าพิเศษ นั่นคือ มีสี่ช่องในกระดานที่สร้างสี่เหลี่ยมผืนผ้าและแต่ละช่องมีตัวเลือกเดียวกันสองตัว เมื่อโครงสร้างนี้ปรากฏในกระดาน หมายความว่าซูโดกุนี้ไม่ถูกต้อง ดังนั้น {{deleteStr}} ต้องลบตัวเลือก {{target}} เพื่อให้ซูโดกุมีคำตอบเดียว',
      UNIQUE_RECTANGLE2:
        'หากช่องสีแดงมีค่า {{target}} สี่ช่องที่ {{nodeStr}} จะสร้างโครงสร้างสี่เหลี่ยมผืนผ้าพิเศษ นั่นคือ มีสี่ช่องในกระดานที่สร้างสี่เหลี่ยมผืนผ้าและแต่ละช่องมีตัวเลือกเดียวกันสองตัว เมื่อโครงสร้างนี้ปรากฏในกระดาน หมายความว่าซูโดกุนี้ไม่ถูกต้อง ดังนั้นช่องสีแดงจะไม่สามารถมีตัวเลือก {{target}} ได้',
      BINARY_UNIVERSAL_GRAVE:
        'สมมติว่า {{posStr}} ไม่มีค่า {{target}} ทุกช่องในกระดานจะมีตัวเลือกเพียงสองตัว และแต่ละตัวเลือกจะปรากฏเพียงสองครั้งในแต่ละแถว คอลัมน์ และกล่อง โครงสร้างนี้จะทำให้ซูโดกุมีหลายคำตอบ เพื่อหลีกเลี่ยงสถานการณ์นี้ {{posStr}} ต้องมีค่า {{target}}',
      SWORDFISH_ROW:
        'ช่องสีฟ้าที่อยู่ในสามแถวไม่มีช่องอื่นที่มีตัวเลือก{{target}} ไม่ว่าจะเลือกช่องใดในกลุ่มนี้ ตัวเลือก{{target}}ไม่ควรปรากฏในสามคอลัมน์ที่เกี่ยวข้อง',
      SWORDFISH_COLUMN:
        'ช่องสีฟ้าที่อยู่ในสามคอลัมน์ไม่มีช่องอื่นที่มีตัวเลือก{{target}} ไม่ว่าจะเลือกช่องใดในกลุ่มนี้ ตัวเลือก{{target}}ไม่ควรปรากฏในสามแถวที่เกี่ยวข้อง',
      JELLYFISH_ROW:
        'ช่องสีฟ้าที่อยู่ในสี่แถวไม่มีช่องอื่นที่มีตัวเลือก{{target}} ไม่ว่าจะเลือกช่องใดในกลุ่มนี้ ตัวเลือก{{target}}ไม่ควรปรากฏในสี่คอลัมน์ที่เกี่ยวข้อง',
      JELLYFISH_COLUMN:
        'ช่องสีฟ้าที่อยู่ในสี่คอลัมน์ไม่มีช่องอื่นที่มีตัวเลือก{{target}} ไม่ว่าจะเลือกช่องใดในกลุ่มนี้ ตัวเลือก{{target}}ไม่ควรปรากฏในสี่แถวที่เกี่ยวข้อง',
      DOUBLE_COLOR_CHAIN_delete:
        'เมื่อ {{posStr}} มีค่า {{target}} ช่องสีแดงไม่สามารถมีค่า {{target}} ได้',
      DOUBLE_COLOR_CHAIN_s:
        'เมื่อ {{posStr1}} มีค่า {{target1}} จะทำให้ {{posStr2}} มีค่า {{target2}}',
      DOUBLE_COLOR_CHAIN_r:
        'เมื่อ {{posStr1}} มีค่า {{target}} จะทำให้ {{posStr2}} ไม่สามารถมีค่า {{target}} ได้',
      DOUBLE_COLOR_CHAIN_q:
        'เนื่องจาก {{posStr1}} และ {{posStr2}} สร้างการเชื่อมโยงที่แข็งแกร่งสำหรับ {{target}} ดังนั้น {{posStr2}} ต้องมีค่า {{target}}',
      DOUBLE_COLOR_CHAIN_q_start:
        'เมื่อ {{posStr}} มีค่า {{target1}} ช่องปัจจุบันไม่สามารถมีค่า {{target2}} ได้',
    },
    back: 'กลับ',
    next: 'ด่านต่อไป',
    errorDraft: 'บันทึกมีข้อผิดพลาด กรุณาแก้ไข',
    pleaseConnectNetwork: 'กรุณาเชื่อมต่ออินเทอร์เน็ต',
    setting: 'ตั้งค่า',
    removeAD: 'ลบโฆษณา',
    sound: 'เสียง',
    notice: 'แจ้งเตือน',
    privacyPolicy: 'นโยบายความเป็นส่วนตัว',
    serviceTerms: 'ข้อกำหนดการให้บริการ',
    language: 'ภาษา',
    feedback: 'ข้อแนะนำ',
    feedbackMessage: 'ข้อความ:',
    congratulations: 'ยินดีด้วย!',
    restore: 'กู้คืนการซื้อ',
    restoring: 'กู้คืนการซื้อ...',
    purchasing: 'กำลังซื้อ...',
    illegalPrompt:
      'ระบบตรวจสอบว่าคุณออกจากโปรแกรมบ่อยเกินไป อาจเป็นเพราะการหลีกเลี่ยงโฆษณา กรุณารอหนึ่งนาทีแล้วลองใหม่อีกครั้ง',
    highlight: 'เน้นสี',
    myBoards: 'สมุดรายการของฉัน',
    Home: 'หน้าหลัก',
    saveToMyBoards: 'บันทึกในสมุดรายการของฉัน',
    pleaseNameYourSudoku: 'กรุณาตั้งชื่อสมุดรายการของฉัน',
    success: 'สำเร็จ',
    sudokuSavedToMyBoards: 'สมุดรายการของฉันถูกบันทึกไว้!',
    error: 'ข้อผิดพลาด',
    saveFailedPleaseTryAgainLater: 'บันทึกไม่สำเร็จ กรุณาลองใหม่อีกครั้ง',
    confirm: 'ยืนยัน',
    noNetwork:
      'คุณไม่มีการเชื่อมต่ออินเทอร์เน็ต ถ้าคุณดำเนินการต่อ สมุดรายการของคุณจะไม่ถูกบันทึก คุณต้องการดำเนินการต่อหรือไม่?',
    loading: 'กำลังดำเนินการ...',
    pleaseCheckNetwork: 'การดำเนินการไม่สำเร็จ กรุณาตรวจสอบว่ามีการเชื่อมต่ออินเทอร์เน็ตหรือไม่',
    pleaseCheckiCloud: 'การดำเนินการไม่สำเร็จ กรุณาตรวจสอบว่ามีการเข้ารหัส iCloud หรือไม่',
    untitled: 'ไม่มีชื่อ',
    enlarge: 'ขยาย',
    encourage: 'ช่วยเรา❤️',
    share: 'แชร์',
    shareMessage: 'สมุดรายการของฉันถูกบันทึกไว้!',
    wether: 'ไม่ว่าจะเป็นอะไรก็ตาม ช่องสีแดงไม่สามารถมีค่า {{target}} ได้',
    case1: 'กรณี 1:',
    case2: 'กรณี 2:',
    case3: 'กรณี 3:',
    comma: ',',
    period: '.',
    end1: 'ช่องสีแดงไม่สามารถมีค่า {{target}} ได้',
    end2: 'ช่องสีแดงยังคงไม่สามารถมีค่า {{target}} ได้',
  },
};
