export default {
  translation: {
    home: {
      title: 'Судоку',
      startGame: 'Почати гру',
      createGame: 'Створити гру',
      settings: 'Налаштування',
    },
    game: {
      pause: 'Пауза',
      resume: 'Продовжити',
      restart: 'Почати заново',
      quit: 'Вийти',
    },
    difficulty: {
      title: 'Виберіть складність',
      entry: '😀Початковий',
      easy: '🤔Легкий',
      medium: '😮Середній',
      hard: '😣Складний',
      extreme: '🤯Екстремальний',
      custom: 'Користувацький',
    },
    start: 'Почати',
    continue: 'Продовжити',
    undo: 'Скасувати',
    erase: 'Стерти',
    notes: 'Нотатки',
    autoNote: 'Авто-нотатки',
    hint: 'Підказка',
    apply: 'Застосувати',
    cancel: 'Скасувати',
    selectMode: 'Вибрати режим',
    legal: 'Судоку правильне',
    solving: "Розв'язування...",
    illegal: 'Судоку неправильне',
    answer: 'Відповідь',
    incomplete: 'Судоку не завершене',
    CHECK_CANDIDATE: 'Перевірка кандидатів',
    SINGLE_CANDIDATE: 'Єдиний кандидат',
    HIDDEN_SINGLE_ROW: 'Прихований одинак',
    HIDDEN_SINGLE_COLUMN: 'Прихований одинак',
    HIDDEN_SINGLE_BOX: 'Прихований одинак',
    BLOCK_ELIMINATION_ROW: 'Блокове виключення',
    BLOCK_ELIMINATION_COLUMN: 'Блокове виключення',
    BLOCK_ELIMINATION_BOX_ROW: 'Блокове виключення',
    BLOCK_ELIMINATION_BOX_COLUMN: 'Блокове виключення',
    NAKED_PAIR_ROW: 'Відкрита пара',
    NAKED_PAIR_COLUMN: 'Відкрита пара',
    NAKED_PAIR_BOX: 'Відкрита пара',
    NAKED_TRIPLE_ROW1: 'Відкрита трійка',
    NAKED_TRIPLE_COLUMN1: 'Відкрита трійка',
    NAKED_TRIPLE_BOX1: 'Відкрита трійка',
    NAKED_TRIPLE_ROW2: 'Відкрита трійка',
    NAKED_TRIPLE_COLUMN2: 'Відкрита трійка',
    NAKED_TRIPLE_BOX2: 'Відкрита трійка',
    HIDDEN_PAIR_ROW: 'Прихована пара',
    HIDDEN_PAIR_COLUMN: 'Прихована пара',
    HIDDEN_PAIR_BOX: 'Прихована пара',
    HIDDEN_TRIPLE_ROW: 'Прихована трійка',
    HIDDEN_TRIPLE_COLUMN: 'Прихована трійка',
    HIDDEN_TRIPLE_BOX: 'Прихована трійка',
    NAKED_QUADRUPLE_ROW: 'Відкрита четвірка',
    NAKED_QUADRUPLE_COLUMN: 'Відкрита четвірка',
    NAKED_QUADRUPLE_BOX: 'Відкрита четвірка',
    X_WING_ROW: 'X-крило',
    X_WING_COLUMN: 'X-крило',
    X_WING_VARIENT_ROW: 'X-крило з плавником',
    X_WING_VARIENT_COLUMN: 'X-крило з плавником',
    XY_WING: 'XY-крило',
    XYZ_WING: 'XYZ-крило',
    SKYSCRAPER: 'Хмарочос',
    SKYSCRAPER2: 'Два сильні зв\'язки',
    THREESTRONGLINKS: 'Три сильні зв\'язки',
    XCHAIN: 'X-ланцюг',
    COMBINATION_CHAIN: 'Комбінаційний ланцюг',
    SWORDFISH_ROW: 'Риба-меч',
    SWORDFISH_COLUMN: 'Риба-меч',
    JELLYFISH_ROW: 'Медуза',
    JELLYFISH_COLUMN: 'Медуза',
    WXYZ_WING: 'WXYZ-крило',
    LOOP: 'Цикл',
    UNIQUE_RECTANGLE: 'Унікальний прямокутник',
    BINARY_UNIVERSAL_GRAVE: 'Бінарна універсальна могила',
    DOUBLE_COLOR_CHAIN: 'Двоколірний ланцюг',
    TRIPLE_COLOR_CHAIN: 'Трьохколірний ланцюг',
    TRIAL_AND_ERROR: 'Метод спроб і помилок',
    duration: 'Час',
    mistakes: 'Помилки',
    hintCount: 'Підказки',
    hints: {
      SINGLE_CANDIDATE:
        'У клітинці R{{row}}C{{col}} залишився лише один кандидат {{target}}, тому це значення можна встановити',
      HIDDEN_SINGLE_ROW:
        'Число {{target}} у рядку {{row}} може бути лише в одній клітинці, тому це значення можна встановити',
      HIDDEN_SINGLE_COLUMN:
        'Число {{target}} у стовпці {{col}} може бути лише в одній клітинці, тому це значення можна встановити',
      HIDDEN_SINGLE_BOX:
        'Число {{target}} у блоці {{box}} може бути лише в одній клітинці, тому це значення можна встановити',
      TRIAL_AND_ERROR:
        "Спробуйте вставити {{target}} у клітинку з найменшою кількістю кандидатів. Якщо це призведе до неможливого розв'язку, значить {{target}} неправильне, і потрібно спробувати інші кандидати",
      BLOCK_ELIMINATION_ROW:
        'У блоці {{box}} число {{target}} може бути лише в позиціях {{positions}}, тому в інших позиціях того ж рядка не може бути {{target}}',
      BLOCK_ELIMINATION_COLUMN:
        'У блоці {{box}} число {{target}} може бути лише в позиціях {{positions}}, тому в інших позиціях того ж стовпця не може бути {{target}}',
      BLOCK_ELIMINATION_BOX_ROW:
        'У рядку {{row}} число {{target}} може бути лише в позиціях {{positions}}, тому в інших позиціях того ж блоку не може бути {{target}}',
      BLOCK_ELIMINATION_BOX_COLUMN:
        'У стовпці {{col}} число {{target}} може бути лише в позиціях {{positions}}, тому в інших позиціях того ж блоку не може бути {{target}}',
      NAKED_PAIR_ROW:
        'У рядку {{row}} числа {{target}} можуть бути лише в двох клітинках {{positions}}, тому в інших клітинках цього рядка не може бути {{target}}',
      NAKED_PAIR_COLUMN:
        'У стовпці {{col}} числа {{target}} можуть бути лише в двох клітинках {{positions}}, тому в інших клітинках цього стовпця не може бути {{target}}',
      NAKED_PAIR_BOX:
        'У блоці {{box}} числа {{target}} можуть бути лише в двох клітинках {{positions}}, тому в інших клітинках цього блоку не може бути {{target}}',
      NAKED_TRIPLE_ROW1:
        'У рядку {{row}} числа {{target}} можуть бути лише в трьох клітинках {{positions}}, тому в інших клітинках цього рядка не може бути {{target}}',
      NAKED_TRIPLE_COLUMN1:
        'У стовпці {{col}} числа {{target}} можуть бути лише в трьох клітинках {{positions}}, тому в інших клітинках цього стовпця не може бути {{target}}',
      NAKED_TRIPLE_BOX1:
        'У блоці {{box}} числа {{target}} можуть бути лише в трьох клітинках {{positions}}, тому в інших клітинках цього блоку не може бути {{target}}',
      NAKED_TRIPLE_ROW2:
        'У рядку {{row}} числа {{target}} можуть бути лише в трьох клітинках {{positions}}, тому в інших клітинках цього рядка не може бути {{target}}',
      NAKED_TRIPLE_COLUMN2:
        'У стовпці {{col}} числа {{target}} можуть бути лише в трьох клітинках {{positions}}, тому в інших клітинках цього стовпця не може бути {{target}}',
      NAKED_TRIPLE_BOX2:
        'У блоці {{box}} числа {{target}} можуть бути лише в трьох клітинках {{positions}}, тому в інших клітинках цього блоку не може бути {{target}}',
      NAKED_QUADRUPLE_ROW:
        'У рядку {{row}} числа {{target}} можуть бути лише в чотирьох клітинках {{positions}}, тому в інших клітинках цього рядка не може бути {{target}}',
      NAKED_QUADRUPLE_COLUMN:
        'У стовпці {{col}} числа {{target}} можуть бути лише в чотирьох клітинках {{positions}}, тому в інших клітинках цього стовпця не може бути {{target}}',
      NAKED_QUADRUPLE_BOX:
        'У блоці {{box}} числа {{target}} можуть бути лише в чотирьох клітинках {{positions}}, тому в інших клітинках цього блоку не може бути {{target}}',
      HIDDEN_PAIR_ROW:
        "У рядку {{row}} числа {{candStr}} з'являються лише в клітинках {{positions}}, тому ці клітинки не можуть містити інших кандидатів",
      HIDDEN_PAIR_COLUMN:
        "У стовпці {{col}} числа {{candStr}} з'являються лише в клітинках {{positions}}, тому ці клітинки не можуть містити інших кандидатів",
      HIDDEN_PAIR_BOX:
        "У блоці {{box}} числа {{candStr}} з'являються лише в клітинках {{positions}}, тому ці клітинки не можуть містити інших кандидатів",
      HIDDEN_TRIPLE_ROW:
        "У рядку {{row}} числа {{candStr}} з'являються лише в трьох клітинках {{positions}}, тому ці клітинки не можуть містити інших кандидатів",
      HIDDEN_TRIPLE_COLUMN:
        "У стовпці {{col}} числа {{candStr}} з'являються лише в трьох клітинках {{positions}}, тому ці клітинки не можуть містити інших кандидатів",
      HIDDEN_TRIPLE_BOX:
        "У блоці {{box}} числа {{candStr}} з'являються лише в трьох клітинках {{positions}}, тому ці клітинки не можуть містити інших кандидатів",
      X_WING_ROW:
        'У рядках {{row1}} та {{row2}} число {{candStr}} має по дві можливі позиції в тих самих стовпцях. Незалежно від того, які дві з цих чотирьох позицій правильні, інші позиції в цих стовпцях не можуть містити {{candStr}}',
      X_WING_COLUMN:
        'У стовпцях {{col1}} та {{col2}} число {{candStr}} має по дві можливі позиції в тих самих рядках. Незалежно від того, які дві з цих чотирьох позицій правильні, інші позиції в цих рядках не можуть містити {{candStr}}',
      X_WING_VARIENT_ROW:
        'Незалежно від того, які дві з {{length}} позицій {{positions}} містять {{candStr}}, клітинка R{{row}}C{{col}} не може містити {{candStr}}',
      X_WING_VARIENT_COLUMN:
        'Незалежно від того, які дві з {{length}} позицій {{positions}} містять {{candStr}}, клітинка R{{row}}C{{col}} не може містити {{candStr}}',
      XY_WING:
        'Незалежно від значень у трьох клітинках {{positions}}, {{deleteStr}} не може містити число {{candStr}}',
      XYZ_WING:
        'Незалежно від значень у трьох клітинках {{positions}}, {{deleteStr}} не може містити число {{candStr}}',
      SKYSCRAPER:
        'Сині клітинки {{positions}} утворюють спряжений ланцюг. Незалежно від того, чи R{{row1}}C{{col1}} чи R{{row2}}C{{col2}} містить {{target}}, {{deleteStr}} не може містити {{target}}',
      SKYSCRAPER2:
        "Клітинки R{{row1}}C{{col1}} та R{{row2}}C{{col2}} утворюють сильний ланцюг, а R{{row3}}C{{col3}} та R{{row4}}C{{col4}} утворюють інший сильний ланцюг. Ці два ланцюги з'єднані слабким ланцюгом між R{{row3}}C{{col3}} та R{{row2}}C{{col2}}. Якщо R{{row1}}C{{col1}} істинне, то {{deleteStr}} має бути хибним. Якщо R{{row1}}C{{col1}} хибне, то R{{row4}}C{{col4}} має бути істинним, що також робить {{deleteStr}} хибним. У будь-якому випадку, {{target}} не може бути в {{deleteStr}}",
      WXYZ_WING:
        '{{candStr}} утворює WXYZ-крило з центром у R{{row1}}C{{col1}}. Незалежно від значень у цих чотирьох клітинках, {{target}} не може бути в {{deleteStr}}',
      COMBINATION_CHAIN_3_2_1_STRONG:
        'Комбінація {{candStr1}} та {{candStr2}} утворює сильний ланцюг. Незалежно від того, яке значення в {{candStr4}} істинне, {{target}} не може бути в {{posStr}}',
      COMBINATION_CHAIN_3_2_1_WEAK:
        "Комбінація {{candStr1}} та {{candStr2}} утворює сильний ланцюг, {{candStr3}} утворює сильний ланцюг у чотирьох клітинках. Ці два ланцюги з'єднані слабким ланцюгом через {{pivotStr}}. Незалежно від того, яке значення в {{candStr4}} істинне, {{target}} не може бути в {{posStr}}",
      COMBINATION_CHAIN_3_2_2_WEAK:
        "Комбінація {{candStr1}} та {{candStr2}} утворює сильний ланцюг, {{candStr3}} утворює сильний ланцюг у двох клітинках. Ці два ланцюги з'єднані слабким ланцюгом через {{pivotStr1}} та {{pivotStr2}}. Незалежно від того, яке значення в {{candStr4}} істинне, {{target}} не може бути в {{posStr}}",
      COMBINATION_CHAIN_3_2_2_STRONG:
        "Комбінація {{candStr1}} та {{candStr2}} утворює сильний ланцюг, {{candStr3}} утворює сильний ланцюг у двох клітинках. Ці два ланцюги з'єднані сильним ланцюгом через {{pivotStr1}} та {{pivotStr2}}. Незалежно від того, яке значення в {{candStr4}} істинне, {{target}} не може бути в {{posStr}}",
      LOOP_3_2_2:
        "{{nodeStr1}} утворює сильний ланцюг, {{nodeStr2}} утворює сильний ланцюг, {{nodeStr3}} утворює сильний ланцюг. Ці три сильні ланцюги з'єднані слабким ланцюгом для утворення циклу. Припустимо, що {{rootNodeStr}} хибне і починається з нього, тоді логічна дедукція в обох напрямках закінчиться протиріччям у циклі, тому {{rootNodeStr}} має бути істинним.",
      LOOP_3_2:
        "{{nodeStr1}} утворює сильний ланцюг, {{nodeStr2}} утворює сильний ланцюг. Ці два сильні ланцюги з'єднані слабким ланцюгом для утворення циклу. Припустимо, що {{rootNodeStr}} хибне і починається з нього, тоді логічна дедукція в обох напрямках закінчиться протиріччям у циклі, тому {{rootNodeStr}} має бути істинним.",
      UNIQUE_RECTANGLE1:
        "{{nodeStr}} та {{deleteStr}} утворюють подібну унікальну прямокутну структуру, тобто на дошці є чотири клітинки, які утворюють прямокутник і розташовані в двох блоках, і кожна з них має два однакових кандидати. Коли на дошці з'являється така структура, це означає, що судоку є нелегальним, тому {{deleteStr}} повинен видалити кандидата {{target}}, щоб забезпечити унікальне рішення судоку",
      UNIQUE_RECTANGLE2:
        "Якщо червона клітинка містить {{target}}, тоді чотири клітинки {{nodeStr}} утворюють унікальну прямокутну структуру, тобто на дошці є чотири клітинки, які утворюють прямокутник і розташовані в двох блоках, і кожна з них має два однакових кандидати. Коли на дошці з'являється така структура, це означає, що поточний судоку є недійсним. Тому червона клітинка не може містити кандидата {{target}}",
      BINARY_UNIVERSAL_GRAVE:
        "Припустимо, що {{posStr}} не містить {{target}}, тоді всі кандидатні клітинки на дошці матимуть лише два кандидати, і кожен кандидат з'являється лише двічі в кожному рядку, стовпці та блоці. Ця структура призведе до множинних рішень у судоку. Щоб уникнути цієї ситуації, {{posStr}} повинен містити {{target}}",
      SWORDFISH_ROW:
        'Сині клітинки, розташовані в трьох рядках, не мають інших кандидатів для {{target}}. Незалежно від того, які значення приймають ці клітинки, у відповідних трьох стовпцях не повинно бути кандидата {{target}}',
      SWORDFISH_COLUMN:
        'Сині клітинки, розташовані в трьох стовпцях, не мають інших кандидатів для {{target}}. Незалежно від того, які значення приймають ці клітинки, у відповідних трьох рядках не повинно бути кандидата {{target}}',
      JELLYFISH_ROW:
        'Сині клітинки, розташовані в чотирьох рядках, не мають інших кандидатів для {{target}}. Незалежно від того, які значення приймають ці клітинки, у відповідних чотирьох стовпцях не повинно бути кандидата {{target}}',
      JELLYFISH_COLUMN:
        'Сині клітинки, розташовані в чотирьох стовпцях, не мають інших кандидатів для {{target}}. Незалежно від того, які значення приймають ці клітинки, у відповідних чотирьох рядках не повинно бути кандидата {{target}}',
      DOUBLE_COLOR_CHAIN_delete:
        'коли {{posStr}} приймає значення {{target}}, червона клітинка не може прийняти {{target}}',
      DOUBLE_COLOR_CHAIN_s:
        'коли {{posStr1}} приймає значення {{target1}}, це призводить до того, що {{posStr2}} приймає {{target2}}',
      DOUBLE_COLOR_CHAIN_r:
        'коли {{posStr1}} приймає значення {{target}}, це призводить до того, що {{posStr2}} не може прийняти {{target}}',
      DOUBLE_COLOR_CHAIN_q:
        "оскільки {{posStr1}} та {{posStr2}} утворюють сильний зв'язок для {{target}}, {{posStr2}} має бути {{target}}",
      DOUBLE_COLOR_CHAIN_q_start:
        'коли {{posStr}} приймає значення {{target1}}, поточна клітинка не може прийняти {{target2}}',
      COMBINATION_CHAIN_AB_STRONG: "{{A}} та {{B}} утворюють сильний зв'язок",
      COMBINATION_CHAIN_AB_WEAK: "{{A}} та {{B}} утворюють слабкий зв'язок",
      COMBINATION_CHAIN_END: 'Коли {{A}} істинне, червона клітинка хибна. Коли {{A}} хибне, шляхом дедукції {{B}} стає істинним, і червона клітинка залишається хибною',
        SKYSCRAPER2_1:"Між двома клітинками {{As}} існує сильний зв'язок, між чотирма клітинками {{Bs}} існує сильний зв'язок, і ці два сильні зв'язки з'єднані слабким зв'язком між двома клітинками {{Cs}}. Коли {{A}} істинне, червона клітинка хибна. Коли {{A}} хибне, {{B}} істинне, і червона клітинка залишається хибною",
        SKYSCRAPER2_2:"Між двома клітинками {{As}} існує сильний зв'язок, між двома клітинками {{Bs}} існує сильний зв'язок, і між двома клітинками {{Cs}} існує сильний зв'язок. Кожен сильний зв'язок з'єднаний з іншими слабкими зв'язками. Коли {{A}} істинне, червона клітинка хибна. Коли {{A}} хибне, {{B}} істинне, і червона клітинка залишається хибною"
    },
    back: 'Назад',
    next: 'Наступний рівень',
    errorDraft: 'У нотатках є помилки, спочатку виправте їх',
    pleaseConnectNetwork: 'Будь ласка, підключіться до мережі',
    setting: 'Налаштування',
    removeAD: 'Прибрати рекламу',
    sound: 'Звук',
    notice: 'Сповіщення',
    privacyPolicy: 'Політика конфіденційності',
    serviceTerms: 'Умови обслуговування',
    language: 'Мова',
    feedback: 'Відгук',
    feedbackMessage: 'Повідомлення:',
    congratulations: 'Вітаємо!',
    restore: 'Відновити покупку',
    restoring: 'Відновлюємо покупку...',
    purchasing: 'Купуємо...',
    illegalPrompt:
      'Система виявила, що ви часто виходите з програми, що може бути ознакою уникнення реклами. Будь ласка, почекайте хвилину і спробуйте ще раз.',
    highlight: 'Підсвітити',
    myBoards: 'Мої судоку',
    Home: 'Головна',
    saveToMyBoards: 'Зберегти в Мої судоку',
    pleaseNameYourSudoku: "Будь ласка, дайте своєму судоку ім'я",
    success: 'Успіх',
    sudokuSavedToMyBoards: 'Судоку збережено в Мої судоку!',
    error: 'Помилка',
    saveFailedPleaseTryAgainLater: 'Збереження не вдалося, будь ласка, спробуйте ще раз пізніше',
    confirm: 'Підтвердити',
    noNetwork:
      "У вас немає інтернет-з'єднання. Якщо ви продовжите, ваш судоку не буде збережений. Ви хочете продовжити?",
    loading: 'Завантаження...',
    pleaseCheckNetwork:
      "Завантаження не вдалося, будь ласка, перевірте, чи встановлено інтернет-з'єднання",
    pleaseCheckiCloud: 'Завантаження не вдалося, будь ласка, перевірте, чи встановлено iCloud',
    untitled: 'Без назви',
    enlarge: 'Збільшити',
    encourage: 'Підтримайте нас❤️',
    share: 'Поділитися',
    shareMessage: 'Ігра в судоку, яка підтримує налаштування, спробуйте!',
    wether: 'Яким би не був випадок, червона клітинка не може містити {{target}}',
    case1: 'Випадок 1:',
    case2: 'Випадок 2:',
    case3: 'Випадок 3:',
    comma: ',',
    period: '.',
    end1: 'Червона клітинка не може містити {{target}}',
    end2: 'Червона клітинка все ще не може містити {{target}}',
    theme: 'Тема',
    selectTheme: 'Вибрати тему',
    lightMode: 'Світла тема',
    darkMode: 'Темна тема',
    strictMode: 'Строгий режим',
    reasonMode: 'Режим доказу',
    strictText:
      'Строгий режим: Если введенное значение не соответствует ответу, отображается сообщение об ошибке',
    reasonText:
      'Режим доказательства: Если введенное значение не соответствует ответу, не отображается сообщение об ошибке',
    localGames: 'Локальні судоку',
    statistics: 'Статистика',
    entry: 'Початковий',
    easy: 'Легкий',
    medium: 'Середній',
    hard: 'Складний',
    extreme: 'Екстремальний',
    dataSync: 'Інструкція для синхронізації даних',
    dataSyncDescription:
      "1.Дружнє нагадування: Якщо ви змінюєте пристрій, дані iCloud можуть не відразу синхронізуватися з новим пристроєм. Ми рекомендуємо кілька разів відкрити додаток або зачекати деякий час. Протягом цього періоду ви можете працювати з локальними головоломками. Після оновлення старих даних додаток автоматично допоможе вам об'єднати нові дані.",
    total: 'Загальний',
    pleaseLoginGameCenter: 'Будь ласка, спочатку увійдіть у GameCenter. Якщо ви вже увійшли, перезапустіть додаток.',
    tips: 'Підказки',
    dataSyncDescription2: '2.Ваш рейтинг буде синхронізовано глобально протягом 24 годин.',
  },
};
